GopalSaraf/Practicals/PSDL/include/proc/pic16lf18857.inc
// Register: CWG3CON0
#define CWG3CON0 CWG3CON0
CWG3CON0                                 equ 0690h
// bitfield definitions
CWG3CON0_MODE_POSN                       equ 0000h
CWG3CON0_MODE_POSITION                   equ 0000h
CWG3CON0_MODE_SIZE                       equ 0003h
CWG3CON0_MODE_LENGTH                     equ 0003h
CWG3CON0_MODE_MASK                       equ 0007h
CWG3CON0_LD_POSN                         equ 0006h
CWG3CON0_LD_POSITION                     equ 0006h
CWG3CON0_LD_SIZE                         equ 0001h
CWG3CON0_LD_LENGTH                       equ 0001h
CWG3CON0_LD_MASK                         equ 0040h
CWG3CON0_EN_POSN                         equ 0007h
CWG3CON0_EN_POSITION                     equ 0007h
CWG3CON0_EN_SIZE                         equ 0001h
CWG3CON0_EN_LENGTH                       equ 0001h
CWG3CON0_EN_MASK                         equ 0080h
CWG3CON0_MODE0_POSN                      equ 0000h
CWG3CON0_MODE0_POSITION                  equ 0000h
CWG3CON0_MODE0_SIZE                      equ 0001h
CWG3CON0_MODE0_LENGTH                    equ 0001h
CWG3CON0_MODE0_MASK                      equ 0001h
CWG3CON0_MODE1_POSN                      equ 0001h
CWG3CON0_MODE1_POSITION                  equ 0001h
CWG3CON0_MODE1_SIZE                      equ 0001h
CWG3CON0_MODE1_LENGTH                    equ 0001h
CWG3CON0_MODE1_MASK                      equ 0002h
CWG3CON0_MODE2_POSN                      equ 0002h
CWG3CON0_MODE2_POSITION                  equ 0002h
CWG3CON0_MODE2_SIZE                      equ 0001h
CWG3CON0_MODE2_LENGTH                    equ 0001h
CWG3CON0_MODE2_MASK                      equ 0004h
CWG3CON0_G3EN_POSN                       equ 0007h
CWG3CON0_G3EN_POSITION                   equ 0007h
CWG3CON0_G3EN_SIZE                       equ 0001h
CWG3CON0_G3EN_LENGTH                     equ 0001h
CWG3CON0_G3EN_MASK                       equ 0080h
CWG3CON0_CWG3MODE_POSN                   equ 0000h
CWG3CON0_CWG3MODE_POSITION               equ 0000h
CWG3CON0_CWG3MODE_SIZE                   equ 0003h
CWG3CON0_CWG3MODE_LENGTH                 equ 0003h
CWG3CON0_CWG3MODE_MASK                   equ 0007h
CWG3CON0_CWG3LD_POSN                     equ 0006h
CWG3CON0_CWG3LD_POSITION                 equ 0006h
CWG3CON0_CWG3LD_SIZE                     equ 0001h
CWG3CON0_CWG3LD_LENGTH                   equ 0001h
CWG3CON0_CWG3LD_MASK                     equ 0040h
CWG3CON0_CWG3EN_POSN                     equ 0007h
CWG3CON0_CWG3EN_POSITION                 equ 0007h
CWG3CON0_CWG3EN_SIZE                     equ 0001h
CWG3CON0_CWG3EN_LENGTH                   equ 0001h
CWG3CON0_CWG3EN_MASK                     equ 0080h
CWG3CON0_CWG3MODE0_POSN                  equ 0000h
CWG3CON0_CWG3MODE0_POSITION              equ 0000h
CWG3CON0_CWG3MODE0_SIZE                  equ 0001h
CWG3CON0_CWG3MODE0_LENGTH                equ 0001h
CWG3CON0_CWG3MODE0_MASK                  equ 0001h
CWG3CON0_CWG3MODE1_POSN                  equ 0001h
CWG3CON0_CWG3MODE1_POSITION              equ 0001h
CWG3CON0_CWG3MODE1_SIZE                  equ 0001h
CWG3CON0_CWG3MODE1_LENGTH                equ 0001h
CWG3CON0_CWG3MODE1_MASK                  equ 0002h
CWG3CON0_CWG3MODE2_POSN                  equ 0002h
CWG3CON0_CWG3MODE2_POSITION              equ 0002h
CWG3CON0_CWG3MODE2_SIZE                  equ 0001h
CWG3CON0_CWG3MODE2_LENGTH                equ 0001h
CWG3CON0_CWG3MODE2_MASK                  equ 0004h

// Register: CWG3CON1
#define CWG3CON1 CWG3CON1
CWG3CON1                                 equ 0691h
// bitfield definitions
CWG3CON1_POLA_POSN                       equ 0000h
CWG3CON1_POLA_POSITION                   equ 0000h
CWG3CON1_POLA_SIZE                       equ 0001h
CWG3CON1_POLA_LENGTH                     equ 0001h
CWG3CON1_POLA_MASK                       equ 0001h
CWG3CON1_POLB_POSN                       equ 0001h
CWG3CON1_POLB_POSITION                   equ 0001h
CWG3CON1_POLB_SIZE                       equ 0001h
CWG3CON1_POLB_LENGTH                     equ 0001h
CWG3CON1_POLB_MASK                       equ 0002h
CWG3CON1_POLC_POSN                       equ 0002h
CWG3CON1_POLC_POSITION                   equ 0002h
CWG3CON1_POLC_SIZE                       equ 0001h
CWG3CON1_POLC_LENGTH                     equ 0001h
CWG3CON1_POLC_MASK                       equ 0004h
CWG3CON1_POLD_POSN                       equ 0003h
CWG3CON1_POLD_POSITION                   equ 0003h
CWG3CON1_POLD_SIZE                       equ 0001h
CWG3CON1_POLD_LENGTH                     equ 0001h
CWG3CON1_POLD_MASK                       equ 0008h
CWG3CON1_IN_POSN                         equ 0005h
CWG3CON1_IN_POSITION                     equ 0005h
CWG3CON1_IN_SIZE                         equ 0001h
CWG3CON1_IN_LENGTH                       equ 0001h
CWG3CON1_IN_MASK                         equ 0020h
CWG3CON1_CWG3POLA_POSN                   equ 0000h
CWG3CON1_CWG3POLA_POSITION               equ 0000h
CWG3CON1_CWG3POLA_SIZE                   equ 0001h
CWG3CON1_CWG3POLA_LENGTH                 equ 0001h
CWG3CON1_CWG3POLA_MASK                   equ 0001h
CWG3CON1_CWG3POLB_POSN                   equ 0001h
CWG3CON1_CWG3POLB_POSITION               equ 0001h
CWG3CON1_CWG3POLB_SIZE                   equ 0001h
CWG3CON1_CWG3POLB_LENGTH                 equ 0001h
CWG3CON1_CWG3POLB_MASK                   equ 0002h
CWG3CON1_CWG3POLC_POSN                   equ 0002h
CWG3CON1_CWG3POLC_POSITION               equ 0002h
CWG3CON1_CWG3POLC_SIZE                   equ 0001h
CWG3CON1_CWG3POLC_LENGTH                 equ 0001h
CWG3CON1_CWG3POLC_MASK                   equ 0004h
CWG3CON1_CWG3POLD_POSN                   equ 0003h
CWG3CON1_CWG3POLD_POSITION               equ 0003h
CWG3CON1_CWG3POLD_SIZE                   equ 0001h
CWG3CON1_CWG3POLD_LENGTH                 equ 0001h
CWG3CON1_CWG3POLD_MASK                   equ 0008h
CWG3CON1_CWG3IN_POSN                     equ 0005h
CWG3CON1_CWG3IN_POSITION                 equ 0005h
CWG3CON1_CWG3IN_SIZE                     equ 0001h
CWG3CON1_CWG3IN_LENGTH                   equ 0001h
CWG3CON1_CWG3IN_MASK                     equ 0020h

// Register: CWG3AS0
#define CWG3AS0 CWG3AS0
CWG3AS0                                  equ 0692h
// bitfield definitions
CWG3AS0_LSAC_POSN                        equ 0002h
CWG3AS0_LSAC_POSITION                    equ 0002h
CWG3AS0_LSAC_SIZE                        equ 0002h
CWG3AS0_LSAC_LENGTH                      equ 0002h
CWG3AS0_LSAC_MASK                        equ 000Ch
CWG3AS0_LSBD_POSN                        equ 0004h
CWG3AS0_LSBD_POSITION                    equ 0004h
CWG3AS0_LSBD_SIZE                        equ 0002h
CWG3AS0_LSBD_LENGTH                      equ 0002h
CWG3AS0_LSBD_MASK                        equ 0030h
CWG3AS0_REN_POSN                         equ 0006h
CWG3AS0_REN_POSITION                     equ 0006h
CWG3AS0_REN_SIZE                         equ 0001h
CWG3AS0_REN_LENGTH                       equ 0001h
CWG3AS0_REN_MASK                         equ 0040h
CWG3AS0_SHUTDOWN_POSN                    equ 0007h
CWG3AS0_SHUTDOWN_POSITION                equ 0007h
CWG3AS0_SHUTDOWN_SIZE                    equ 0001h
CWG3AS0_SHUTDOWN_LENGTH                  equ 0001h
CWG3AS0_SHUTDOWN_MASK                    equ 0080h
CWG3AS0_LSAC0_POSN                       equ 0002h
CWG3AS0_LSAC0_POSITION                   equ 0002h
CWG3AS0_LSAC0_SIZE                       equ 0001h
CWG3AS0_LSAC0_LENGTH                     equ 0001h
CWG3AS0_LSAC0_MASK                       equ 0004h
CWG3AS0_LSAC1_POSN                       equ 0003h
CWG3AS0_LSAC1_POSITION                   equ 0003h
CWG3AS0_LSAC1_SIZE                       equ 0001h
CWG3AS0_LSAC1_LENGTH                     equ 0001h
CWG3AS0_LSAC1_MASK                       equ 0008h
CWG3AS0_LSBD0_POSN                       equ 0004h
CWG3AS0_LSBD0_POSITION                   equ 0004h
CWG3AS0_LSBD0_SIZE                       equ 0001h
CWG3AS0_LSBD0_LENGTH                     equ 0001h
CWG3AS0_LSBD0_MASK                       equ 0010h
CWG3AS0_LSBD1_POSN                       equ 0005h
CWG3AS0_LSBD1_POSITION                   equ 0005h
CWG3AS0_LSBD1_SIZE                       equ 0001h
CWG3AS0_LSBD1_LENGTH                     equ 0001h
CWG3AS0_LSBD1_MASK                       equ 0020h
CWG3AS0_CWG3LSAC_POSN                    equ 0002h
CWG3AS0_CWG3LSAC_POSITION                equ 0002h
CWG3AS0_CWG3LSAC_SIZE                    equ 0002h
CWG3AS0_CWG3LSAC_LENGTH                  equ 0002h
CWG3AS0_CWG3LSAC_MASK                    equ 000Ch
CWG3AS0_CWG3LSBD_POSN                    equ 0004h
CWG3AS0_CWG3LSBD_POSITION                equ 0004h
CWG3AS0_CWG3LSBD_SIZE                    equ 0002h
CWG3AS0_CWG3LSBD_LENGTH                  equ 0002h
CWG3AS0_CWG3LSBD_MASK                    equ 0030h
CWG3AS0_CWG3REN_POSN                     equ 0006h
CWG3AS0_CWG3REN_POSITION                 equ 0006h
CWG3AS0_CWG3REN_SIZE                     equ 0001h
CWG3AS0_CWG3REN_LENGTH                   equ 0001h
CWG3AS0_CWG3REN_MASK                     equ 0040h
CWG3AS0_CWG3SHUTDOWN_POSN                equ 0007h
CWG3AS0_CWG3SHUTDOWN_POSITION            equ 0007h
CWG3AS0_CWG3SHUTDOWN_SIZE                equ 0001h
CWG3AS0_CWG3SHUTDOWN_LENGTH              equ 0001h
CWG3AS0_CWG3SHUTDOWN_MASK                equ 0080h
CWG3AS0_CWG3LSAC0_POSN                   equ 0002h
CWG3AS0_CWG3LSAC0_POSITION               equ 0002h
CWG3AS0_CWG3LSAC0_SIZE                   equ 0001h
CWG3AS0_CWG3LSAC0_LENGTH                 equ 0001h
CWG3AS0_CWG3LSAC0_MASK                   equ 0004h
CWG3AS0_CWG3LSAC1_POSN                   equ 0003h
CWG3AS0_CWG3LSAC1_POSITION               equ 0003h
CWG3AS0_CWG3LSAC1_SIZE                   equ 0001h
CWG3AS0_CWG3LSAC1_LENGTH                 equ 0001h
CWG3AS0_CWG3LSAC1_MASK                   equ 0008h
CWG3AS0_CWG3LSBD0_POSN                   equ 0004h
CWG3AS0_CWG3LSBD0_POSITION               equ 0004h
CWG3AS0_CWG3LSBD0_SIZE                   equ 0001h
CWG3AS0_CWG3LSBD0_LENGTH                 equ 0001h
CWG3AS0_CWG3LSBD0_MASK                   equ 0010h
CWG3AS0_CWG3LSBD1_POSN                   equ 0005h
CWG3AS0_CWG3LSBD1_POSITION               equ 0005h
CWG3AS0_CWG3LSBD1_SIZE                   equ 0001h
CWG3AS0_CWG3LSBD1_LENGTH                 equ 0001h
CWG3AS0_CWG3LSBD1_MASK                   equ 0020h

// Register: CWG3AS1
#define CWG3AS1 CWG3AS1
CWG3AS1                                  equ 0693h
// bitfield definitions
CWG3AS1_AS0E_POSN                        equ 0000h
CWG3AS1_AS0E_POSITION                    equ 0000h
CWG3AS1_AS0E_SIZE                        equ 0001h
CWG3AS1_AS0E_LENGTH                      equ 0001h
CWG3AS1_AS0E_MASK                        equ 0001h
CWG3AS1_AS1E_POSN                        equ 0001h
CWG3AS1_AS1E_POSITION                    equ 0001h
CWG3AS1_AS1E_SIZE                        equ 0001h
CWG3AS1_AS1E_LENGTH                      equ 0001h
CWG3AS1_AS1E_MASK                        equ 0002h
CWG3AS1_AS2E_POSN                        equ 0002h
CWG3AS1_AS2E_POSITION                    equ 0002h
CWG3AS1_AS2E_SIZE                        equ 0001h
CWG3AS1_AS2E_LENGTH                      equ 0001h
CWG3AS1_AS2E_MASK                        equ 0004h
CWG3AS1_AS3E_POSN                        equ 0003h
CWG3AS1_AS3E_POSITION                    equ 0003h
CWG3AS1_AS3E_SIZE                        equ 0001h
CWG3AS1_AS3E_LENGTH                      equ 0001h
CWG3AS1_AS3E_MASK                        equ 0008h
CWG3AS1_AS4E_POSN                        equ 0004h
CWG3AS1_AS4E_POSITION                    equ 0004h
CWG3AS1_AS4E_SIZE                        equ 0001h
CWG3AS1_AS4E_LENGTH                      equ 0001h
CWG3AS1_AS4E_MASK                        equ 0010h
CWG3AS1_AS5E_POSN                        equ 0005h
CWG3AS1_AS5E_POSITION                    equ 0005h
CWG3AS1_AS5E_SIZE                        equ 0001h
CWG3AS1_AS5E_LENGTH                      equ 0001h
CWG3AS1_AS5E_MASK                        equ 0020h
CWG3AS1_AS6E_POSN                        equ 0006h
CWG3AS1_AS6E_POSITION                    equ 0006h
CWG3AS1_AS6E_SIZE                        equ 0001h
CWG3AS1_AS6E_LENGTH                      equ 0001h
CWG3AS1_AS6E_MASK                        equ 0040h

// Register: CWG3STR
#define CWG3STR CWG3STR
CWG3STR                                  equ 0694h
// bitfield definitions
CWG3STR_STRA_POSN                        equ 0000h
CWG3STR_STRA_POSITION                    equ 0000h
CWG3STR_STRA_SIZE                        equ 0001h
CWG3STR_STRA_LENGTH                      equ 0001h
CWG3STR_STRA_MASK                        equ 0001h
CWG3STR_STRB_POSN                        equ 0001h
CWG3STR_STRB_POSITION                    equ 0001h
CWG3STR_STRB_SIZE                        equ 0001h
CWG3STR_STRB_LENGTH                      equ 0001h
CWG3STR_STRB_MASK                        equ 0002h
CWG3STR_STRC_POSN                        equ 0002h
CWG3STR_STRC_POSITION                    equ 0002h
CWG3STR_STRC_SIZE                        equ 0001h
CWG3STR_STRC_LENGTH                      equ 0001h
CWG3STR_STRC_MASK                        equ 0004h
CWG3STR_STRD_POSN                        equ 0003h
CWG3STR_STRD_POSITION                    equ 0003h
CWG3STR_STRD_SIZE                        equ 0001h
CWG3STR_STRD_LENGTH                      equ 0001h
CWG3STR_STRD_MASK                        equ 0008h
CWG3STR_OVRA_POSN                        equ 0004h
CWG3STR_OVRA_POSITION                    equ 0004h
CWG3STR_OVRA_SIZE                        equ 0001h
CWG3STR_OVRA_LENGTH                      equ 0001h
CWG3STR_OVRA_MASK                        equ 0010h
CWG3STR_OVRB_POSN                        equ 0005h
CWG3STR_OVRB_POSITION                    equ 0005h
CWG3STR_OVRB_SIZE                        equ 0001h
CWG3STR_OVRB_LENGTH                      equ 0001h
CWG3STR_OVRB_MASK                        equ 0020h
CWG3STR_OVRC_POSN                        equ 0006h
CWG3STR_OVRC_POSITION                    equ 0006h
CWG3STR_OVRC_SIZE                        equ 0001h
CWG3STR_OVRC_LENGTH                      equ 0001h
CWG3STR_OVRC_MASK                        equ 0040h
CWG3STR_OVRD_POSN                        equ 0007h
CWG3STR_OVRD_POSITION                    equ 0007h
CWG3STR_OVRD_SIZE                        equ 0001h
CWG3STR_OVRD_LENGTH                      equ 0001h
CWG3STR_OVRD_MASK                        equ 0080h
CWG3STR_CWG3STRA_POSN                    equ 0000h
CWG3STR_CWG3STRA_POSITION                equ 0000h
CWG3STR_CWG3STRA_SIZE                    equ 0001h
CWG3STR_CWG3STRA_LENGTH                  equ 0001h
CWG3STR_CWG3STRA_MASK                    equ 0001h
CWG3STR_CWG3STRB_POSN                    equ 0001h
CWG3STR_CWG3STRB_POSITION                equ 0001h
CWG3STR_CWG3STRB_SIZE                    equ 0001h
CWG3STR_CWG3STRB_LENGTH                  equ 0001h
CWG3STR_CWG3STRB_MASK                    equ 0002h
CWG3STR_CWG3STRC_POSN                    equ 0002h
CWG3STR_CWG3STRC_POSITION                equ 0002h
CWG3STR_CWG3STRC_SIZE                    equ 0001h
CWG3STR_CWG3STRC_LENGTH                  equ 0001h
CWG3STR_CWG3STRC_MASK                    equ 0004h
CWG3STR_CWG3STRD_POSN                    equ 0003h
CWG3STR_CWG3STRD_POSITION                equ 0003h
CWG3STR_CWG3STRD_SIZE                    equ 0001h
CWG3STR_CWG3STRD_LENGTH                  equ 0001h
CWG3STR_CWG3STRD_MASK                    equ 0008h
CWG3STR_CWG3OVRA_POSN                    equ 0004h
CWG3STR_CWG3OVRA_POSITION                equ 0004h
CWG3STR_CWG3OVRA_SIZE                    equ 0001h
CWG3STR_CWG3OVRA_LENGTH                  equ 0001h
CWG3STR_CWG3OVRA_MASK                    equ 0010h
CWG3STR_CWG3OVRB_POSN                    equ 0005h
CWG3STR_CWG3OVRB_POSITION                equ 0005h
CWG3STR_CWG3OVRB_SIZE                    equ 0001h
CWG3STR_CWG3OVRB_LENGTH                  equ 0001h
CWG3STR_CWG3OVRB_MASK                    equ 0020h
CWG3STR_CWG3OVRC_POSN                    equ 0006h
CWG3STR_CWG3OVRC_POSITION                equ 0006h
CWG3STR_CWG3OVRC_SIZE                    equ 0001h
CWG3STR_CWG3OVRC_LENGTH                  equ 0001h
CWG3STR_CWG3OVRC_MASK                    equ 0040h
CWG3STR_CWG3OVRD_POSN                    equ 0007h
CWG3STR_CWG3OVRD_POSITION                equ 0007h
CWG3STR_CWG3OVRD_SIZE                    equ 0001h
CWG3STR_CWG3OVRD_LENGTH                  equ 0001h
CWG3STR_CWG3OVRD_MASK                    equ 0080h

// Register: PIR0
#define PIR0 PIR0
PIR0                                     equ 070Ch
// bitfield definitions
PIR0_INTF_POSN                           equ 0000h
PIR0_INTF_POSITION                       equ 0000h
PIR0_INTF_SIZE                           equ 0001h
PIR0_INTF_LENGTH                         equ 0001h
PIR0_INTF_MASK                           equ 0001h
PIR0_IOCIF_POSN                          equ 0004h
PIR0_IOCIF_POSITION                      equ 0004h
PIR0_IOCIF_SIZE                          equ 0001h
PIR0_IOCIF_LENGTH                        equ 0001h
PIR0_IOCIF_MASK                          equ 0010h
PIR0_TMR0IF_POSN                         equ 0005h
PIR0_TMR0IF_POSITION                     equ 0005h
PIR0_TMR0IF_SIZE                         equ 0001h
PIR0_TMR0IF_LENGTH                       equ 0001h
PIR0_TMR0IF_MASK                         equ 0020h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 070Dh
// bitfield definitions
PIR1_ADIF_POSN                           equ 0000h
PIR1_ADIF_POSITION                       equ 0000h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0001h
PIR1_ADTIF_POSN                          equ 0001h
PIR1_ADTIF_POSITION                      equ 0001h
PIR1_ADTIF_SIZE                          equ 0001h
PIR1_ADTIF_LENGTH                        equ 0001h
PIR1_ADTIF_MASK                          equ 0002h
PIR1_CSWIF_POSN                          equ 0006h
PIR1_CSWIF_POSITION                      equ 0006h
PIR1_CSWIF_SIZE                          equ 0001h
PIR1_CSWIF_LENGTH                        equ 0001h
PIR1_CSWIF_MASK                          equ 0040h
PIR1_OSFIF_POSN                          equ 0007h
PIR1_OSFIF_POSITION                      equ 0007h
PIR1_OSFIF_SIZE                          equ 0001h
PIR1_OSFIF_LENGTH                        equ 0001h
PIR1_OSFIF_MASK                          equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 070Eh
// bitfield definitions
PIR2_C1IF_POSN                           equ 0000h
PIR2_C1IF_POSITION                       equ 0000h
PIR2_C1IF_SIZE                           equ 0001h
PIR2_C1IF_LENGTH                         equ 0001h
PIR2_C1IF_MASK                           equ 0001h
PIR2_C2IF_POSN                           equ 0001h
PIR2_C2IF_POSITION                       equ 0001h
PIR2_C2IF_SIZE                           equ 0001h
PIR2_C2IF_LENGTH                         equ 0001h
PIR2_C2IF_MASK                           equ 0002h
PIR2_ZCDIF_POSN                          equ 0006h
PIR2_ZCDIF_POSITION                      equ 0006h
PIR2_ZCDIF_SIZE                          equ 0001h
PIR2_ZCDIF_LENGTH                        equ 0001h
PIR2_ZCDIF_MASK                          equ 0040h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 070Fh
// bitfield definitions
PIR3_SSP1IF_POSN                         equ 0000h
PIR3_SSP1IF_POSITION                     equ 0000h
PIR3_SSP1IF_SIZE                         equ 0001h
PIR3_SSP1IF_LENGTH                       equ 0001h
PIR3_SSP1IF_MASK                         equ 0001h
PIR3_BCL1IF_POSN                         equ 0001h
PIR3_BCL1IF_POSITION                     equ 0001h
PIR3_BCL1IF_SIZE                         equ 0001h
PIR3_BCL1IF_LENGTH                       equ 0001h
PIR3_BCL1IF_MASK                         equ 0002h
PIR3_SSP2IF_POSN                         equ 0002h
PIR3_SSP2IF_POSITION                     equ 0002h
PIR3_SSP2IF_SIZE                         equ 0001h
PIR3_SSP2IF_LENGTH                       equ 0001h
PIR3_SSP2IF_MASK                         equ 0004h
PIR3_BCL2IF_POSN                         equ 0003h
PIR3_BCL2IF_POSITION                     equ 0003h
PIR3_BCL2IF_SIZE                         equ 0001h
PIR3_BCL2IF_LENGTH                       equ 0001h
PIR3_BCL2IF_MASK                         equ 0008h
PIR3_TXIF_POSN                           equ 0004h
PIR3_TXIF_POSITION                       equ 0004h
PIR3_TXIF_SIZE                           equ 0001h
PIR3_TXIF_LENGTH                         equ 0001h
PIR3_TXIF_MASK                           equ 0010h
PIR3_RCIF_POSN                           equ 0005h
PIR3_RCIF_POSITION                       equ 0005h
PIR3_RCIF_SIZE                           equ 0001h
PIR3_RCIF_LENGTH                         equ 0001h
PIR3_RCIF_MASK                           equ 0020h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0710h
// bitfield definitions
PIR4_TMR1IF_POSN                         equ 0000h
PIR4_TMR1IF_POSITION                     equ 0000h
PIR4_TMR1IF_SIZE                         equ 0001h
PIR4_TMR1IF_LENGTH                       equ 0001h
PIR4_TMR1IF_MASK                         equ 0001h
PIR4_TMR2IF_POSN                         equ 0001h
PIR4_TMR2IF_POSITION                     equ 0001h
PIR4_TMR2IF_SIZE                         equ 0001h
PIR4_TMR2IF_LENGTH                       equ 0001h
PIR4_TMR2IF_MASK                         equ 0002h
PIR4_TMR3IF_POSN                         equ 0002h
PIR4_TMR3IF_POSITION                     equ 0002h
PIR4_TMR3IF_SIZE                         equ 0001h
PIR4_TMR3IF_LENGTH                       equ 0001h
PIR4_TMR3IF_MASK                         equ 0004h
PIR4_TMR4IF_POSN                         equ 0003h
PIR4_TMR4IF_POSITION                     equ 0003h
PIR4_TMR4IF_SIZE                         equ 0001h
PIR4_TMR4IF_LENGTH                       equ 0001h
PIR4_TMR4IF_MASK                         equ 0008h
PIR4_TMR5IF_POSN                         equ 0004h
PIR4_TMR5IF_POSITION                     equ 0004h
PIR4_TMR5IF_SIZE                         equ 0001h
PIR4_TMR5IF_LENGTH                       equ 0001h
PIR4_TMR5IF_MASK                         equ 0010h
PIR4_TMR6IF_POSN                         equ 0005h
PIR4_TMR6IF_POSITION                     equ 0005h
PIR4_TMR6IF_SIZE                         equ 0001h
PIR4_TMR6IF_LENGTH                       equ 0001h
PIR4_TMR6IF_MASK                         equ 0020h

