GopalSaraf/Practicals/PSDL/include/proc/pic16lf18857.inc
// Register: CCDNC
#define CCDNC CCDNC
CCDNC                                    equ 01F56h
// bitfield definitions
CCDNC_CCDNC0_POSN                        equ 0000h
CCDNC_CCDNC0_POSITION                    equ 0000h
CCDNC_CCDNC0_SIZE                        equ 0001h
CCDNC_CCDNC0_LENGTH                      equ 0001h
CCDNC_CCDNC0_MASK                        equ 0001h
CCDNC_CCDNC1_POSN                        equ 0001h
CCDNC_CCDNC1_POSITION                    equ 0001h
CCDNC_CCDNC1_SIZE                        equ 0001h
CCDNC_CCDNC1_LENGTH                      equ 0001h
CCDNC_CCDNC1_MASK                        equ 0002h
CCDNC_CCDNC2_POSN                        equ 0002h
CCDNC_CCDNC2_POSITION                    equ 0002h
CCDNC_CCDNC2_SIZE                        equ 0001h
CCDNC_CCDNC2_LENGTH                      equ 0001h
CCDNC_CCDNC2_MASK                        equ 0004h
CCDNC_CCDNC3_POSN                        equ 0003h
CCDNC_CCDNC3_POSITION                    equ 0003h
CCDNC_CCDNC3_SIZE                        equ 0001h
CCDNC_CCDNC3_LENGTH                      equ 0001h
CCDNC_CCDNC3_MASK                        equ 0008h
CCDNC_CCDNC4_POSN                        equ 0004h
CCDNC_CCDNC4_POSITION                    equ 0004h
CCDNC_CCDNC4_SIZE                        equ 0001h
CCDNC_CCDNC4_LENGTH                      equ 0001h
CCDNC_CCDNC4_MASK                        equ 0010h
CCDNC_CCDNC5_POSN                        equ 0005h
CCDNC_CCDNC5_POSITION                    equ 0005h
CCDNC_CCDNC5_SIZE                        equ 0001h
CCDNC_CCDNC5_LENGTH                      equ 0001h
CCDNC_CCDNC5_MASK                        equ 0020h
CCDNC_CCDNC6_POSN                        equ 0006h
CCDNC_CCDNC6_POSITION                    equ 0006h
CCDNC_CCDNC6_SIZE                        equ 0001h
CCDNC_CCDNC6_LENGTH                      equ 0001h
CCDNC_CCDNC6_MASK                        equ 0040h
CCDNC_CCDNC7_POSN                        equ 0007h
CCDNC_CCDNC7_POSITION                    equ 0007h
CCDNC_CCDNC7_SIZE                        equ 0001h
CCDNC_CCDNC7_LENGTH                      equ 0001h
CCDNC_CCDNC7_MASK                        equ 0080h

// Register: CCDPC
#define CCDPC CCDPC
CCDPC                                    equ 01F57h
// bitfield definitions
CCDPC_CCDPC0_POSN                        equ 0000h
CCDPC_CCDPC0_POSITION                    equ 0000h
CCDPC_CCDPC0_SIZE                        equ 0001h
CCDPC_CCDPC0_LENGTH                      equ 0001h
CCDPC_CCDPC0_MASK                        equ 0001h
CCDPC_CCDPC1_POSN                        equ 0001h
CCDPC_CCDPC1_POSITION                    equ 0001h
CCDPC_CCDPC1_SIZE                        equ 0001h
CCDPC_CCDPC1_LENGTH                      equ 0001h
CCDPC_CCDPC1_MASK                        equ 0002h
CCDPC_CCDPC2_POSN                        equ 0002h
CCDPC_CCDPC2_POSITION                    equ 0002h
CCDPC_CCDPC2_SIZE                        equ 0001h
CCDPC_CCDPC2_LENGTH                      equ 0001h
CCDPC_CCDPC2_MASK                        equ 0004h
CCDPC_CCDPC3_POSN                        equ 0003h
CCDPC_CCDPC3_POSITION                    equ 0003h
CCDPC_CCDPC3_SIZE                        equ 0001h
CCDPC_CCDPC3_LENGTH                      equ 0001h
CCDPC_CCDPC3_MASK                        equ 0008h
CCDPC_CCDPC4_POSN                        equ 0004h
CCDPC_CCDPC4_POSITION                    equ 0004h
CCDPC_CCDPC4_SIZE                        equ 0001h
CCDPC_CCDPC4_LENGTH                      equ 0001h
CCDPC_CCDPC4_MASK                        equ 0010h
CCDPC_CCDPC5_POSN                        equ 0005h
CCDPC_CCDPC5_POSITION                    equ 0005h
CCDPC_CCDPC5_SIZE                        equ 0001h
CCDPC_CCDPC5_LENGTH                      equ 0001h
CCDPC_CCDPC5_MASK                        equ 0020h
CCDPC_CCDPC6_POSN                        equ 0006h
CCDPC_CCDPC6_POSITION                    equ 0006h
CCDPC_CCDPC6_SIZE                        equ 0001h
CCDPC_CCDPC6_LENGTH                      equ 0001h
CCDPC_CCDPC6_MASK                        equ 0040h
CCDPC_CCDPC7_POSN                        equ 0007h
CCDPC_CCDPC7_POSITION                    equ 0007h
CCDPC_CCDPC7_SIZE                        equ 0001h
CCDPC_CCDPC7_LENGTH                      equ 0001h
CCDPC_CCDPC7_MASK                        equ 0080h

// Register: WPUE
#define WPUE WPUE
WPUE                                     equ 01F65h
// bitfield definitions
WPUE_WPUE0_POSN                          equ 0000h
WPUE_WPUE0_POSITION                      equ 0000h
WPUE_WPUE0_SIZE                          equ 0001h
WPUE_WPUE0_LENGTH                        equ 0001h
WPUE_WPUE0_MASK                          equ 0001h
WPUE_WPUE1_POSN                          equ 0001h
WPUE_WPUE1_POSITION                      equ 0001h
WPUE_WPUE1_SIZE                          equ 0001h
WPUE_WPUE1_LENGTH                        equ 0001h
WPUE_WPUE1_MASK                          equ 0002h
WPUE_WPUE2_POSN                          equ 0002h
WPUE_WPUE2_POSITION                      equ 0002h
WPUE_WPUE2_SIZE                          equ 0001h
WPUE_WPUE2_LENGTH                        equ 0001h
WPUE_WPUE2_MASK                          equ 0004h

// Register: INLVLE
#define INLVLE INLVLE
INLVLE                                   equ 01F68h
// bitfield definitions
INLVLE_INLVLE0_POSN                      equ 0000h
INLVLE_INLVLE0_POSITION                  equ 0000h
INLVLE_INLVLE0_SIZE                      equ 0001h
INLVLE_INLVLE0_LENGTH                    equ 0001h
INLVLE_INLVLE0_MASK                      equ 0001h
INLVLE_INLVLE1_POSN                      equ 0001h
INLVLE_INLVLE1_POSITION                  equ 0001h
INLVLE_INLVLE1_SIZE                      equ 0001h
INLVLE_INLVLE1_LENGTH                    equ 0001h
INLVLE_INLVLE1_MASK                      equ 0002h
INLVLE_INLVLE2_POSN                      equ 0002h
INLVLE_INLVLE2_POSITION                  equ 0002h
INLVLE_INLVLE2_SIZE                      equ 0001h
INLVLE_INLVLE2_LENGTH                    equ 0001h
INLVLE_INLVLE2_MASK                      equ 0004h

// Register: IOCEP
#define IOCEP IOCEP
IOCEP                                    equ 01F69h
// bitfield definitions
IOCEP_IOCEP3_POSN                        equ 0003h
IOCEP_IOCEP3_POSITION                    equ 0003h
IOCEP_IOCEP3_SIZE                        equ 0001h
IOCEP_IOCEP3_LENGTH                      equ 0001h
IOCEP_IOCEP3_MASK                        equ 0008h

// Register: IOCEN
#define IOCEN IOCEN
IOCEN                                    equ 01F6Ah
// bitfield definitions
IOCEN_IOCEN3_POSN                        equ 0003h
IOCEN_IOCEN3_POSITION                    equ 0003h
IOCEN_IOCEN3_SIZE                        equ 0001h
IOCEN_IOCEN3_LENGTH                      equ 0001h
IOCEN_IOCEN3_MASK                        equ 0008h

