GopalSaraf/Practicals/PSDL/include/proc/pic16lf18857.inc
#define ZCDPOL                           BANKMASK(ZCDCON), 4
#define ZCDSEN                           BANKMASK(ZCDCON), 7
#define ZERO                             BANKMASK(STATUS), 2
#define Z_SHAD                           BANKMASK(STATUS_SHAD), 2
#define nADDRESS1                        BANKMASK(SSP1STAT), 5
#define nADDRESS2                        BANKMASK(SSP2STAT), 5
#define nBOR                             BANKMASK(PCON0), 0
#define nDONE                            BANKMASK(ADCON0), 0
#define nPD                              BANKMASK(STATUS), 3
#define nPOR                             BANKMASK(PCON0), 1
#define nRI                              BANKMASK(PCON0), 2
#define nRMCLR                           BANKMASK(PCON0), 3
#define nRWDT                            BANKMASK(PCON0), 4
#define nT1SYNC                          BANKMASK(T1CON), 2
#define nT3SYNC                          BANKMASK(T3CON), 2
#define nT5SYNC                          BANKMASK(T5CON), 2
#define nTO                              BANKMASK(STATUS), 4
#define nWDTWV                           BANKMASK(PCON0), 5
#define nWRITE1                          BANKMASK(SSP1STAT), 2
#define nWRITE2                          BANKMASK(SSP2STAT), 2

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec
psect udata_bank13,class=BANK13,space=SPACE_DATA,noexec
psect udata_bank14,class=BANK14,space=SPACE_DATA,noexec
psect udata_bank15,class=BANK15,space=SPACE_DATA,noexec
psect udata_bank16,class=BANK16,space=SPACE_DATA,noexec
psect udata_bank17,class=BANK17,space=SPACE_DATA,noexec
psect udata_bank18,class=BANK18,space=SPACE_DATA,noexec
psect udata_bank19,class=BANK19,space=SPACE_DATA,noexec
psect udata_bank20,class=BANK20,space=SPACE_DATA,noexec
psect udata_bank21,class=BANK21,space=SPACE_DATA,noexec
psect udata_bank22,class=BANK22,space=SPACE_DATA,noexec
psect udata_bank23,class=BANK23,space=SPACE_DATA,noexec
psect udata_bank24,class=BANK24,space=SPACE_DATA,noexec
psect udata_bank25,class=BANK25,space=SPACE_DATA,noexec
psect udata_bank26,class=BANK26,space=SPACE_DATA,noexec
psect udata_bank27,class=BANK27,space=SPACE_DATA,noexec
psect udata_bank28,class=BANK28,space=SPACE_DATA,noexec
psect udata_bank29,class=BANK29,space=SPACE_DATA,noexec
psect udata_bank30,class=BANK30,space=SPACE_DATA,noexec
psect udata_bank31,class=BANK31,space=SPACE_DATA,noexec
psect udata_bank32,class=BANK32,space=SPACE_DATA,noexec
psect udata_bank33,class=BANK33,space=SPACE_DATA,noexec
psect udata_bank34,class=BANK34,space=SPACE_DATA,noexec
psect udata_bank35,class=BANK35,space=SPACE_DATA,noexec
psect udata_bank36,class=BANK36,space=SPACE_DATA,noexec
psect udata_bank37,class=BANK37,space=SPACE_DATA,noexec
psect udata_bank38,class=BANK38,space=SPACE_DATA,noexec
psect udata_bank39,class=BANK39,space=SPACE_DATA,noexec
psect udata_bank40,class=BANK40,space=SPACE_DATA,noexec
psect udata_bank41,class=BANK41,space=SPACE_DATA,noexec
psect udata_bank42,class=BANK42,space=SPACE_DATA,noexec
psect udata_bank43,class=BANK43,space=SPACE_DATA,noexec
psect udata_bank44,class=BANK44,space=SPACE_DATA,noexec
psect udata_bank45,class=BANK45,space=SPACE_DATA,noexec
psect udata_bank46,class=BANK46,space=SPACE_DATA,noexec
psect udata_bank47,class=BANK47,space=SPACE_DATA,noexec
psect udata_bank48,class=BANK48,space=SPACE_DATA,noexec
psect udata_bank49,class=BANK49,space=SPACE_DATA,noexec
psect udata_bank50,class=BANK50,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC16LF18857_INC_
